app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$04$1drLBG9fAk2RpUXXWAr4TuMM8LgT6kYWvAeuPdeNI0mnDem9R81SS"], ["updated_at", "2015-08-17 03:48:01.521502"], ["id", 762146111]]
---
  def update
    byebug
    if params[:user][:password].empty?
      flash.now[:danger] = "Password can't be empty"
      render 'edit'
    elsif @user.update_attributes(user_params)